#pragma once

#include "..\TableControl.h"


////////////////////////////////////////////////////////////////////////////////
//		Объявление типа Table
////////////////////////////////////////////////////////////////////////////////

AR_DECLARE_API(
	aht::TableControl, ahtr::Aspect, aoe::Schema,
	Table,
	// {10602B67-24BF-4948-9B11-02237A8050B2}
	( 0x10, 0x60, 0x2b, 0x67, 0x24, 0xbf, 0x49, 0x48, 0x9b, 0x11, 0x02, 0x23, 0x7a, 0x80, 0x50, 0xb2 ),
	// Регистрируемые сущности
	CLASSINFO
)


////////////////////////////////////////////////////////////////////////////////
//		Объявление информации о типе
////////////////////////////////////////////////////////////////////////////////

AR_DECLARE_CLASSINFO(
	aht::TableControl, ahtr::Aspect, aoe::Schema,
	(
		AR_NSTR(L"Таблица"),
		AR_NSTR(L"Компонент построения таблиц")
	)
)
