#pragma once

#include "..\AlarmsControl.h"


////////////////////////////////////////////////////////////////////////////////
//		Объявление типа Alarms
////////////////////////////////////////////////////////////////////////////////

AR_DECLARE_API(
	aha::AlarmsControl, ahar::Aspect, aoe::Schema,
	AlphaAlarms,
	// {C65FF4DC-F22B-47D3-9333-72C4E4E5F662}
	( 0xc6, 0x5f, 0xf4, 0xdc, 0xf2, 0x2b, 0x47, 0xd3, 0x93, 0x33, 0x72, 0xc4, 0xe4, 0xe5, 0xf6, 0x62 ),
	// Регистрируемые сущности
	CLASSINFO
)


////////////////////////////////////////////////////////////////////////////////
//		Объявление информации о типе
////////////////////////////////////////////////////////////////////////////////

AR_DECLARE_CLASSINFO(
	aha::AlarmsControl, ahar::Aspect, aoe::Schema,
	(
		AR_NSTR(L"События"),
		AR_NSTR(L"Компонент отображения технологических событий")
	)
)
